## Staging: idp
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                        NAME                        |
|--------|----------------------------------------------------|
| add    | `module.idp_ecs.aws_ecs_task_definition.this`      |
| update | `module.idp_ecs.aws_appautoscaling_target.this[0]` |
|        | `module.idp_ecs.aws_ecs_service.this`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.idp_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "zitadel"
      + task_role_arn        = (known after apply)
    }

  # module.idp_ecs.aws_appautoscaling_target.this[0] will be updated in-place
  ~ resource "aws_appautoscaling_target" "this" {
        id                 = "service/idp/zitadel"
      ~ max_capacity       = 3 -> 6
      ~ min_capacity       = 1 -> 3
        tags               = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.idp_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:687401027353:service/idp/zitadel"
        name                               = "zitadel"
        tags                               = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "zitadel:7" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.idp_ecs.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + command                = [
                      + "start-from-init",
                      + "--masterkeyFromEnv",
                      + "--tlsMode",
                      + "enabled",
                      + "--config",
                      + "/app/config.yaml",
                      + "--steps",
                      + "/app/steps.yaml",
                    ]
                  + environment            = [
                      + {
                          + name  = "ZITADEL_EXTERNALDOMAIN"
                          + value = "auth.forms-staging.cdssandbox.xyz"
                        },
                    ]
                  + essential              = true
                  + image                  = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/zitadel:latest"
                  + linuxParameters        = {
                      + capabilities = {
                          + add  = []
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration       = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/idp/zitadel"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "task"
                        }
                    }
                  + mountPoints            = []
                  + name                   = "zitadel"
                  + portMappings           = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                          + protocol      = "tcp"
                        },
                    ]
                  + readonlyRootFilesystem = true
                  + secrets                = [
                      + {
                          + name      = "ZITADEL_DATABASE_POSTGRES_ADMIN_PASSWORD"
                          + valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/idp_database_cluster_admin_password"
                        },
                      + {
                          + name      = "ZITADEL_DATABASE_POSTGRES_ADMIN_USERNAME"
                          + valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/idp_database_cluster_admin_username"
                        },
                      + {
                          + name      = "ZITADEL_DATABASE_POSTGRES_DATABASE"
                          + valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_name"
                        },
                      + {
                          + name      = "ZITADEL_DATABASE_POSTGRES_HOST"
                          + valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_host"
                        },
                      + {
                          + name      = "ZITADEL_DATABASE_POSTGRES_USER_PASSWORD"
                          + valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_user_password"
                        },
                      + {
                          + name      = "ZITADEL_DATABASE_POSTGRES_USER_USERNAME"
                          + valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_database_user_username"
                        },
                      + {
                          + name      = "ZITADEL_FIRSTINSTANCE_ORG_HUMAN_PASSWORD"
                          + valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_admin_password"
                        },
                      + {
                          + name      = "ZITADEL_FIRSTINSTANCE_ORG_HUMAN_USERNAME"
                          + valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_admin_username"
                        },
                      + {
                          + name      = "ZITADEL_MASTERKEY"
                          + valueFrom = "arn:aws:ssm:ca-central-1:687401027353:parameter/zitadel_secret_key"
                        },
                    ]
                  + systemControls         = []
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "4096"
      + execution_role_arn       = "arn:aws:iam::687401027353:role/zitadel_ecs_task_exec_role"
      + family                   = "zitadel"
      + id                       = (known after apply)
      + memory                   = "8096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + task_role_arn            = "arn:aws:iam::687401027353:role/zitadel_ecs_task_role"
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.idp_protocol_version"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.idp"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
